IDEA Open Model
ConcreteULSCheckResultTorsionEc2 Properties
Compatible with IDEA StatiCa Beta 20.0
The ConcreteULSCheckResultTorsionEc2 type exposes the following members.
Properties
Name | Description
Check
 settings of check type
 (Inherited from ConcreteCheckResultBase.)
CheckValue
 calculated limited value, calculated as strain to limit strain
 (Inherited from ConcreteCheckResultBase.)
InternalFores
 internal forces used for calculation
 (Inherited from ConcreteCheckResultBase.)
LimitCheckValue
 limit check value for result check
 (Inherited from ConcreteCheckResultBase.)
NonConformities
 Returns nonconformity in section
 (Inherited from ConcreteCheckResultBase.)
Result
 check result passed/failed
 (Inherited from ConcreteCheckResultBase.)
Ted
 Design value of the applied torsional moment
Trd
 decisive design torsional resistance
Trdc
 torsional cracking moment
Trdmax
 design torsional resistance moment
Trds
 design torsional resistance moment of shear reinforcement
Top
See Also
Reference
ConcreteULSCheckResultTorsionEc2 Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace